using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Shapes;
using MapEditor.Models.Help;
using MapEditor.Views.Pages;

namespace MapEditor.Views.Windows
{
    
    /// <summary>
    /// Логика взаимодействия для HelpWindow.xaml
    /// </summary>
    public partial class HelpWindow : Window
    {
        public HelpWindow()
        {
            InitializeComponent();
            Frame.NavigationService.Navigate(new HelpSectionsListPage(
                new List<BaseHelpSection>
                {
                    new HelpSection
                    {
                        Title = "Общие сведения",
                        Description = "Переключение режимов работы программы осуществляется с помощью " +
                                      "выбора инструмента из окна инструментов, расположенного в верхнем правом углу. " +
                                      "Выбранный инструмент отмечается наложением полупрозрачного серого цвета. " +
                                      "В левом верхнем углу расположено окно объектов для связи, содержащее список доступных для связи объектов."
                    },
                    new HelpCompositeSection
                    {
                        Title = "Инструменты",
                        InnerHelpSections = new List<BaseHelpSection>
                        {
                            new HelpSection
                            {
                                Title = "Курсор",
                                Description = "В режиме «Курсор» можно выделять элементы (точки, области) " +
                                              "и выполнять операции удаления, изменения свойств элемента. " +
                                              "Выделенный элемент отмечается оранжевым цветом. Операции выполняются " +
                                              "с помощью всплывающего контекстного меню, которое вызывается при нажатии правой кнопкой по выбранному элементу. " +
                                              "Удаление выделенных элементов может быть исполнено при нажатии кнопки DELETE"
                            },
                            new HelpSection
                            {
                                Title = "Рука",
                                Description = "В режиме «Рука» можно перетаскивать элементы с помощью зажатой левой кнопки мыши " +
                                              "(точки, точки редактируемой области), меняя их координаты."
                            },
                            new HelpSection
                            {
                                Title = "Точка",
                                Description = "В режиме «Точка» пользователь может создавать точки на карте и создавать между ними связи (пути). " +
                                              "Создание точки выполняется нажатием левой кнопки мыши по карте. " +
                                              "Пользователю также доступно выделение и удаление выбранных точек. " +
                                              "Соединение точек происходит через контекстное меню или при выделении точек с зажатой клавишей «SHIFT». "+
                                              "Удаление выделенных элементов может быть исполнено при нажатии кнопки DELETE"
                            },
                            new HelpSection
                            {
                                Title = "Область",
                                Description = "В режиме «Область» можно создавать области на карте, создавая точки области. " +
                                              "Чтобы завершить разметку области и отправить данные на сервер, необходимо нажать на любую поставленную точку в области.\n" +
                                              "ПРИМЕЧАНИЕ: Точки области нельзя двигать в режиме «Область», для перетаскивания точек воспользуйтесь инструментом «Рука»."
                            },
                            new HelpSection
                            {
                                Title = "Маршрут",
                                Description = "В режиме «Маршрут» пользователь может выделять две точки на карте для тестирования построения маршрута. " +
                                              "Маршрут строится сразу после выбора второй точки."
                            },


                        }
                    },
                    new HelpCompositeSection
                    {
                        Title = "Настройки",
                        InnerHelpSections = new List<BaseHelpSection>
                        {
                            new HelpCompositeSection
                            {
                                Title = "Сеть",
                                InnerHelpSections = new List<BaseHelpSection>
                                {
                                    new HelpSection
                                    {
                                        Title = "Ссылка на API",
                                        Description = "В данное поле ввода вставляется ссылка на API проекта, ссылку можно получить у разработчика. " +
                                                      "Флаг использования суффикса api в ссылке определяет, будет ли добавляться к введенной ссылке текст /api или нет."
                                    },
                                    new HelpSection
                                    {
                                        Title = "Добавление и удаление привязываемых объектов",
                                        Description = "Добавление и удаление групп объектов выполняется соответствующими кнопками внизу раздела. " +
                                                      "При добавлении объекта появляется карточка настройки полей объекта. " +
                                                      "Поле «Наименование» отвечает за наименование объекта в приложении, " +
                                                      "в поле «Относительный URL» необходимо ввести относительный URL, по которому можно получить объект из API, " +
                                                      "например, если объект можно получить по ссылке https://127.0.0.1:8000/terminals, то в поле необходимо вписать terminals. " +
                                                      "Поле «Ключ поля в API» должно содержать наименование поля из JSON-схемы объекта в API. " +
                                                      "Имя поля - имя поля, отображаемое в приложении. " +
                                                      "Флаг «Отображать» отвечает за скрытие/отображение поля в приложении. " +
                                                      "Флаг «Первичный ключ» устанавливает, является ли поле первичным ключом " +
                                                      "в JSON-схеме объекта в API (обычно поле первичного ключа называется id). " +
                                                      "Флаг «Индекс» определяет, будет ли поле использоваться в поиске при привязке или нет.\n" +
                                                      "ПРИМЕЧАНИЕ: Обязательным для заполнения является поле первичного ключа, остальные поля заполняются для удобства при связывании."

                                    }
                                }
                            },
                            new HelpSection
                            {
                                Title = "Вид",
                                Description = "В данном разделе можно менять различные визуальные параметры при работе с картой."
                            }
                        },
                    },
                    new HelpSection
                    {
                        Title = "Связывание объектов API с точками и областями",
                        Description = "Связывание выполняется с помощью выбора соответсвующего пункта всплывающего контекстного меню точки или области. " +
                                      "При связывании открывается окно связи объектов, где можно осуществить поиск по объектам, очистить связь или привязать. " +
                                      "Для привязки необходимо выбрать нужный объект и нажать кнопку «Привязать»."
                    }
                }));
        }
    }
}
